In [6]:
import sqlite3
con = sqlite3.connect("hospitals_data.db")
cur = con.cursor()

In [13]:
cur.execute("CREATE TABLE customerss (Customer_Name VARCHAR(255)  NOT NULL, Customer_Id VARCHAR(18) NOT NULL, Open_Date DATE(8) NOT NULL, Last_Consulted_Date DATE(8),Vaccination_Id CHAR(5),Dr_Name CHAR(255),State CHAR(5),Country CHAR(5),DOB DATE(8),Is_Active CHAR(1),PRIMARY KEY(Customer_Name))")
print("table is created")

table is created

In [14]:
sql = "INSERT INTO customerss (Customer_Name,Customer_Id,Open_Date,Last_Consulted_Date,Vaccination_Id,Dr_Name,State,Country,DOB,Is_Active) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)"
val = [('Alex', '123457','2010-10-12','2012-10-13', 'MVD', 'Paul', 'SA', 'USA','06-03-1987', 'A'),
       ("John","123458",'2010-10-12','2012-10-13',"MVD","Paul","TN","IND",'06-03-1987',"A"),
       ("Mathew","123459",'2010-10-12','2012-10-13',"MVD","Paul","WAS","PHIL",'06-03-1987',"A"),
       ("Matt","12345",'2010-10-12','2012-10-13',"MVD","Paul","BOS","NYC",'06-03-1987',"A"),
       ("Jacob","1256",'2010-10-12','2012-10-13',"MVD","Paul","VIC","AU",'06-03-1987',"A")]
cur.executemany(sql,val)
con.commit()
print(cur.rowcount,"row inserted")

5 row inserted

In [15]:
#connection with sqlite 
import pandas as pd
con = sqlite3.connect("hospitals_data.db")
print("connected")

df = pd.read_sql_query("SELECT * from customerss", con)
df

connected

,Customer_Name,Customer_Id,Open_Date,Last_Consulted_Date,Vaccination_Id,Dr_Name,State,Country,DOB,Is_Active
0,Alex,123457,2010-10-12,2012-10-13,MVD,Paul,SA,USA,06-03-1987,A
1,John,123458,2010-10-12,2012-10-13,MVD,Paul,TN,IND,06-03-1987,A
2,Mathew,123459,2010-10-12,2012-10-13,MVD,Paul,WAS,PHIL,06-03-1987,A
3,Matt,12345,2010-10-12,2012-10-13,MVD,Paul,BOS,NYC,06-03-1987,A
4,Jacob,1256,2010-10-12,2012-10-13,MVD,Paul,VIC,AU,06-03-1987,A

In [18]:
contry_list=df['Country'].unique()
contry_list

array(['USA', 'IND', 'PHIL', 'NYC', 'AU'], dtype=object)

In [ ]:
#df1=pd.read_sql_query("CREATE TABLE "+ contry_list[0] +" AS Select Customer_Name,Customer_Id,Open_Date,Last_Consulted_Date,Vaccination_Id,Dr_Name,State,Country,DOB,Is_Active From customers Where Country == "+contry_list[0], con)

In [19]:

for country in contry_list:
    print(country)
    cur.execute("CREATE TABLE "+ country +" AS Select Customer_Name,Customer_Id,Open_Date,Last_Consulted_Date,Vaccination_Id,Dr_Name,State,Country,DOB,Is_Active From customerss Where Country =='"+country+"' Order by Customer_Id")
    print("Tbl is creatd for",country)
    con.commit()

USA
Tbl is creatd for USA
IND
Tbl is creatd for IND
PHIL
Tbl is creatd for PHIL
NYC
Tbl is creatd for NYC
AU
Tbl is creatd for AU

In [20]:

df = pd.read_sql_query("SELECT * from USA", con)
df

,Customer_Name,Customer_Id,Open_Date,Last_Consulted_Date,Vaccination_Id,Dr_Name,State,Country,DOB,Is_Active
0,Alex,123457,2010-10-12,2012-10-13,MVD,Paul,SA,USA,06-03-1987,A

In [21]:

df = pd.read_sql_query("SELECT * from IND", con)
df

,Customer_Name,Customer_Id,Open_Date,Last_Consulted_Date,Vaccination_Id,Dr_Name,State,Country,DOB,Is_Active
0,John,123458,2010-10-12,2012-10-13,MVD,Paul,TN,IND,06-03-1987,A

In [22]:

df = pd.read_sql_query("SELECT * from PHIL", con)
df

,Customer_Name,Customer_Id,Open_Date,Last_Consulted_Date,Vaccination_Id,Dr_Name,State,Country,DOB,Is_Active
0,Mathew,123459,2010-10-12,2012-10-13,MVD,Paul,WAS,PHIL,06-03-1987,A

In [25]:

df = pd.read_sql_query("SELECT * from NYC", con)
df

,Customer_Name,Customer_Id,Open_Date,Last_Consulted_Date,Vaccination_Id,Dr_Name,State,Country,DOB,Is_Active
0,Matt,12345,2010-10-12,2012-10-13,MVD,Paul,BOS,NYC,06-03-1987,A

In [24]:

df = pd.read_sql_query("SELECT * from AU", con)
df

,Customer_Name,Customer_Id,Open_Date,Last_Consulted_Date,Vaccination_Id,Dr_Name,State,Country,DOB,Is_Active
0,Jacob,1256,2010-10-12,2012-10-13,MVD,Paul,VIC,AU,06-03-1987,A